const quizQuestions = [
    {
        question: "ഇന്ത്യയിൽ സൈബർ സുരക്ഷയുമായി ബന്ധപ്പെട്ട ആദ്യ ഐ.ടി. ആക്ട് നിലവിൽ വന്ന വർഷം",
        options: ["2000", "2001", "2008", "2010"],
        correct: 0
    },
    {
        question: "ഇന്ത്യയിൽ സൈബർ നിയമം പാർലമെന്റ് പാസാക്കിയ ദിവസം",
        options: ["2000 മെയ് 13", "2000 ജൂൺ 9", "2000 ആഗസ്റ്റ് 5", "2000 ഒക്ടോബർ 17"],
        correct: 1
    },
    {
        question: "ഇന്ത്യയിൽ സൈബർ നിയമം നിലവിൽ വന്നത്",
        options: ["2000 ഡിസംബർ 23", "2001 ഒക്ടോബർ 27", "2000 ഒക്ടോബർ 17", "2001 ഫെബ്രുവരി 5"],
        correct: 2
    },
    {
        question: "ഇന്ത്യയിൽ സൈബർ നിയമം ഭേദഗതി ചെയ്ത വർഷം",
        options: ["2005", "2006", "2007", "2008"],
        correct: 3
    },
    {
        question: "ഇന്ത്യയിൽ ഭേദഗതി ചെയ്ത സൈബർ നിയമം നിലവിൽ വന്ന വർഷം",
        options: ["2009 ഒക്ടോബർ 27", "2009 നവംബർ 14", "2009 ഡിസംബർ 23", "2009 ഫെബ്രുവരി 14"],
        correct: 0
    },
    {
        question: "ഐ ടി ആക്ടിലെ ഏതു വകുപ്പിലാണ് ചൈൽഡ് പോണോഗ്രാഫിയെക്കുറിച്ച് പ്രതിപാദിക്കുന്നത് ?",
        options: ["സെക്ഷൻ 66E", "സെക്ഷൻ 66F", "സെക്ഷൻ 67A", "സെക്ഷൻ 67B"],
        correct: 3
    },
    {
        question: "സൈബർ ടെററിസവുമായി ബന്ധപ്പെട്ട ഐ.ടി ആക്ട് സെക്ഷൻ",
        options: ["സെക്ഷൻ 66B", "സെക്ഷൻ 66C", "സെക്ഷൻ 66D", "സെക്ഷൻ 66F"],
        correct: 3
    },
    {
        question: "സൈബർ ടെററിസവുമായി ബന്ധപ്പെട്ട ശിക്ഷ",
        options: ["3 വർഷം വരെ തടവും 1 ലക്ഷം രൂപ വരെ പിഴയും", "ജീവപര്യന്തം വരെയുള്ള തടവുശിക്ഷ", "2 വർഷം വരെ തടവും 1 ലക്ഷം രൂപ വരെ പിഴയും", "1 വർഷം വരെ തടവും 50000 രൂപ വരെ പിഴയും"],
        correct: 1
    },
    {
        question: "ആൾമാറാട്ടവുമായി ബന്ധപ്പെട്ട ഐ.ടി ആക്ട് വകുപ്പ്",
        options: ["66B", "66C", "66D", "66E"],
        correct: 2
    },
    {
        question: "ഇന്ത്യയിൽ ഭേദഗതി ചെയ്ത ഐ.ടി നിയമം രാഷ്ട്രപതി ഒപ്പുവച്ച ദിവസം",
        options: ["2008 ഡിസംബർ 23", "2009 ഫെബ്രുവരി 5", "2009 ഒക്ടോബർ 27", "2009 ജൂൺ 21"],
        correct: 1
    },
    {
        question: "സൈബർ നിയമം നിലവിൽ വന്ന ആദ്യ ഏഷ്യൻ രാജ്യം",
        options: ["ഇന്ത്യ", "ചൈന", "സിംഗപ്പൂർ", "ജപ്പാൻ"],
        correct: 2
    },
    {
        question: "സൈബർ നിയമം പ്രാബല്യത്തിൽ വന്ന ആദ്യ ദക്ഷിണേഷ്യൻ രാജ്യം",
        options: ["ഇന്ത്യ", "ശ്രീലങ്ക", "നേപ്പാൾ", "പാകിസ്ഥാൻ"],
        correct: 0
    },
    {
        question: "ഇന്റർനെറ്റിൽ കുട്ടികളുടെ അശ്ലീല ചിത്രങ്ങൾ പ്രചരിപ്പിക്കുന്നത് തടയുന്നതിനായി കേരള പോലീസ് ആരംഭിച്ച പദ്ധതി",
        options: ["ഓപ്പറേഷൻ C ഹണ്ട്", "ഓപ്പറേഷൻ P ഹണ്ട്", "ഓപ്പറേഷൻ K ഹണ്ട്", "ഓപ്പറേഷൻ R ഹണ്ട്"],
        correct: 1
    },
    {
        question: "സൈബർ ടാംപറിങ്ങിനെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന ഐ.ടി ആക്ട് വകുപ്പ്",
        options: ["സെക്ഷൻ 65", "സെക്ഷൻ 66", "സെക്ഷൻ 67", "സെക്ഷൻ 43"],
        correct: 0
    },
    {
        question: "സൈബർ നിയമമനുസരിച്ച് കമ്പ്യൂട്ടർ ഹാക്കിങ്ങിനെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന വകുപ്പ്",
        options: ["സെക്ഷൻ 43", "സെക്ഷൻ 65", "സെക്ഷൻ 66", "സെക്ഷൻ 67"],
        correct: 2
    },
    {
        question: "സൈബർ നിയമമനുസരിച്ച് കമ്പ്യൂട്ടർ ഹാക്കിങ്ങിനു പരമാവധി ലഭിക്കാവുന്ന തടവ് ശിക്ഷ എത്ര ?",
        options: ["1 വർഷം", "2 വർഷം", "3 വർഷം", "4 വർഷം"],
        correct: 2
    },
    {
        question: "ഇലക്ട്രോണിക് ഉപകരണങ്ങളുടെ മോഷണം/മോഷണവസ്തുക്കൾ സ്വീകരിക്കൽ എന്നിവയെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന ഐ.ടി ആക്ടിലെ വകുപ്പ്",
        options: ["സെക്ഷൻ 66B", "സെക്ഷൻ 66C", "സെക്ഷൻ 66D", "സെക്ഷൻ 66E"],
        correct: 0
    },
    {
        question: "എന്തെങ്കിലും സ്വകാര്യവസ്തുക്കൾ, പേഴ്സണൽ ഡയറി, പ്രമാണം എന്നിവ ഒരാളുടെ സമ്മതമില്ലാതെ കൈവശപ്പെടുത്തുന്നത് കുറ്റകരമാണ് എന്നു പ്രതിപാദിക്കുന്ന ഐ.ടി ആക്ടിലെ വകുപ്പ്",
        options: ["സെക്ഷൻ 67", "സെക്ഷൻ 72", "സെക്ഷൻ 73", "സെക്ഷൻ 77"],
        correct: 1
    },
    {
        question: "ഇന്ത്യൻ കമ്പ്യൂട്ടർ എമർജൻസി റെസ്പോൺസ് ടീം നിലവിൽ വന്നത്",
        options: ["2001", "2002", "2003", "2004"],
        correct: 3
    },
    {
        question: "സൈബർ നിയമങ്ങൾ ഇന്ത്യൻ ഭരണഘടനയിൽ എവിടെ ഉൾപ്പെടുത്തിയിരിക്കുന്നു ?",
        options: ["യൂണിയൻ ലിസ്റ്റിൽ", "സ്റ്റേറ്റ് ലിസ്റ്റിൽ", "കൺകറന്റ് ലിസ്റ്റിൽ", "അവശിഷ്ടാധികാരത്തിൽ"],
        correct: 3
    },
    {
        question: "ഐ.ടി ആക്ട് സെക്ഷൻ 66F ഏത് സാഹചര്യത്തിലാണ് ചുമത്തുന്നത്",
        options: [
            "ഒരാൾ മറ്റൊരാളുടെ ഐഡന്റിറ്റി മോഷ്‌ടിക്കുകയും വ്യാജ പ്രൊഫൈൽ സൃഷ്ടിക്കുകയും ചെയ്യുന്നു.", 
            "ഒരു വ്യക്തി സംരക്ഷിത സിസ്റ്റങ്ങളിലേക്ക് അനധികൃതമായി ആക്സസ് നേടുകയും ദേശീയ സുരക്ഷയെ ഭീഷണിപ്പെടുത്തുകയും ചെയ്യുന്നു.", 
            "ഒരു വ്യക്തി ഇമെയിൽ വഴി സ്പാം സന്ദേശങ്ങൾ അയയ്ക്കുന്നു.", 
            "ഒരു വെബ്സൈറ്റിൽ അശ്ലീല ഉള്ളടക്കം പ്രസിദ്ധീകരിക്കുന്നു."
        ],
        correct: 1
    },
    {
        question: "ഐ.ടി ആക്ട് 2000 67B വകുപ്പ് എന്തുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു.",
        options: ["സൈബർ ഭീകരത", "അശ്ലീല ഉള്ളടക്കം പ്രസിദ്ധീകരിക്കൽ", "കുട്ടികൾ ഉൾപ്പെടുന്ന ലൈംഗികത പ്രകടമാക്കുന്ന ഉള്ളടക്കം പ്രസിദ്ധീകരിക്കൽ", "സ്വകാര്യതയുടെ ലംഘനം"],
        correct: 2
    },
    {
        question: "ബി-യുടെ കമ്പ്യൂട്ടറിൽ സൂക്ഷിച്ചിരിക്കുന്ന വിവരങ്ങൾ മിസ്റ്റർ 'എ' 'ബി' യുടെ അറിവില്ലാതെയും അനുവാദമില്ലാതെയും വഞ്ചനാപരമായി ഡൗൺലോഡ് ചെയ്ത് പകർത്തുന്നു. 'എ' യെ ക്രിമിനൽ ബാധ്യതയ്ക്ക് വിധേയനാക്കാൻ കഴിയുമോ ?",
        options: [
            "ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ടിലെ സെക്ഷൻ 66 പ്രകാരം 'എ' യെ ക്രിമിനൽ ബാധ്യതയ്ക്ക് വിധേയമാക്കാം.", 
            "ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ടിലെ സെക്ഷൻ 65 പ്രകാരം 'എ' യെ ക്രിമിനൽ ബാധ്യതയ്ക്ക് വിധേയമാക്കാം.", 
            "ഇല്ല, ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ടിലെ സെക്ഷൻ 43 പ്രകാരം നഷ്ടപരിഹാരം നൽകാൻ മാത്രമേ 'എ' യെ ബാധ്യസ്ഥനാക്കാൻ കഴിയൂ.", 
            "ഇല്ല ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ടിലെ സെക്ഷൻ 44 പ്രകാരം നഷ്ടപരിഹാരം നൽകാൻ മാത്രമേ 'എ' യെ ബാധ്യസ്ഥനാക്കാൻ കഴിയൂ."
        ],
        correct: 0
    },
    {
        question: "ബാങ്ക് ഉദ്യോഗസ്ഥൻ എന്ന വ്യാജേന, മുതിർന്ന പൗരനെ വിളിച്ച്, ബാങ്ക് അക്കൗണ്ട് വിശദാംശങ്ങളും, രഹസ്യ വിവരങ്ങളും ഫോൺ മുഖേനയും, ഇ-മെയിൽ മുഖേനയും ചോർത്തിയെടുത്തു. ശേഷം, മുതിർന്ന പൗരന്റെ അക്കൗണ്ടിൽ നിന്നും 71,000/-രൂപ ഡെബിറ്റ് ചെയ്യപ്പെട്ടു. ഇവിടെ നടന്ന കുറ്റകൃത്യം ഏത്?",
        options: ["തിരിച്ചറിയൽ മോഷണം അഥവാ ഐഡന്റിറ്റി തെഫ്റ്റ്", "സ്വകാര്യത ലംഘനം", "ഹാക്കിംഗ്", "അധികാര ദുർവിനിയോഗം ചെയ്ത് രഹസ്യ ഭാഗങ്ങളിലൂടെ നുഴഞ്ഞുകയറ്റം"],
        correct: 0
    },
    {
        question: "കമ്പ്യൂട്ടർ വൈറസുമായി ബന്ധപ്പെട്ട 2000-ലെ വിവരസാങ്കേതിക നിയമത്തിന്റെ വ്യവസ്ഥ :",
        options: ["വകുപ്പ് 43", "വകുപ്പ് 66", "രണ്ടും (a) & (b)", "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"],
        correct: 2
    },
    {
        question: "വിവര സാങ്കേതിക നിയമം 2000 പ്രകാരം കുട്ടികളുടെ അശ്ലീല സാഹിത്യം കുറ്റകൃത്യമായി കണക്കാക്കുന്നതിന് കുട്ടിയുടെ പ്രായം:",
        options: ["18 വയസ്സിൽ താഴെ", "16 വയസ്സിൽ താഴെ", "12 വയസ്സിൽ താഴെ", "14 വയസ്സിൽ താഴെ"],
        correct: 0
    },
    {
        question: "ഐ.ടി. നിയമത്തിലെ ഈ വ്യവസ്ഥ, പകർപ്പു വകാശ നിയമത്തിന് കീഴിൽ ലഭ്യമായതുപോലുള്ള കമ്പ്യൂട്ടർ സോഴ്സ് ഡോക്യുമെന്റുകൾ (കോഡുകൾ) സംരക്ഷിക്കാനുള്ള ശ്രമമാണ്",
        options: ["സെക്ഷൻ 43", "സെക്ഷൻ 65", "സെക്ഷൻ 66", "സെക്ഷൻ 70"],
        correct: 1
    },
    {
        question: "മനഃപൂർവം ഒരു കമ്പ്യൂട്ടർ സിസ്റ്റത്തിലേക്ക് വൈറസ് പ്രവേശിപ്പിച്ച കുറ്റത്തിനുള്ള ശിക്ഷയെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട് 2000 ലെ വകുപ്പ് താഴെക്കൊടുക്കുന്നതിൽ ഏത് ?",
        options: ["സെക്ഷൻ 43", "സെക്ഷൻ 65", "സെക്ഷൻ 72", "സെക്ഷൻ 77B"],
        correct: 0
    },
    {
        question: "Mr. A ഒരു ഓഫീസിൽ ജോലി ചെയ്യുന്നു, സഹപ്രവർത്തകരായ ചില വ്യക്തികൾക്ക് ഇ- മെയിലുകൾ മുഖേന അശ്ലീല ചിത്രങ്ങൾ അയച്ചു. Mr. A യുടെ പ്രവൃത്തി, ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട് 2000 ലെ താഴെക്കൊടുത്തിട്ടുള്ള ഏതു വകുപ്പിന്റെ ലംഘനം ആണ് ?",
        options: ["സെക്ഷൻ 66 F", "സെക്ഷൻ 67 A", "സെക്ഷൻ 68 A", "സെക്ഷൻ 77 B"],
        correct: 1
    },
    {
        question: "മുൻകൂർ അനുമതിയില്ലാതെ കമ്പ്യൂട്ടർ ആക്സസ് ചെയ്യുന്നത് ________ പ്രകാരം വരുന്ന ഒരു സൈബർ കുറ്റകൃത്യമാണ്.",
        options: ["വകുപ്പ് 65", "വകുപ്പ് 66", "വകുപ്പ് 68", "വകുപ്പ് 70"],
        correct: 1
    },
    {
        question: "കമ്പ്യൂട്ടറുകൾ ഹാക്ക് ചെയ്യുന്നതിനുള്ള ശിക്ഷ എന്താണ്?",
        options: ["മൂന്ന് വർഷം തടവ് അല്ലെങ്കിൽ 10 ലക്ഷം രൂപ പിഴ അല്ലെങ്കിൽ രണ്ടും.", "ജീവപര്യന്തം", "മൂന്ന് വർഷം തടവ് അല്ലെങ്കിൽ 5 ലക്ഷം രൂപ പിഴ അല്ലെങ്കിൽ രണ്ടും", "മൂന്ന് വർഷം തടവ് അല്ലെങ്കിൽ 2 ലക്ഷം രൂപ പിഴ അല്ലെങ്കിൽ രണ്ടും."],
        correct: 2
    },
    {
        question: "2000 ലെ വിവരസാങ്കേതിക നിയമ പ്രകാരം ഡാറ്റ പരിപാലിക്കുന്നതിൽ പരാജയപ്പെട്ടാൽ താഴെപ്പറയുന്നവരിൽ ആരാണ് നഷ്ടപരിഹാരം നൽകാൻ ബാധ്യസ്ഥനായിട്ടുള്ളത്?",
        options: ["സർക്കാർ ഏജൻസികൾ മാത്രം", "ഡാറ്റ നേരിട്ട് കൈകാര്യം ചെയ്യുന്ന വ്യക്തികൾ മാത്രം", "സെൻസിറ്റീവ് സ്വഭാവമുള്ള വ്യക്തിഗത ഡാറ്റയോ വിവരങ്ങളോ കൈവശം വയ്ക്കുന്നതോ കൈകാര്യം ചെയ്യുന്നതോ ആയ ഏതൊരു കമ്പനിയും", "ലാഭേച്ഛയില്ലാത്ത സ്ഥാപനങ്ങൾ മാത്രം"],
        correct: 2
    },
    {
        question: "ഐ.ടി. നിയമത്തിലെ ഏത് വകുപ്പാണ് സൈബർ ഭീകരതയെക്കുറിച്ച് പ്രതിപാദിക്കുന്നത് ?",
        options: ["വകുപ്പ് 66B", "വകുപ്പ് 66C", "വകുപ്പ് 66F", "വകുപ്പ് 66A"],
        correct: 2
    },
    {
        question: "കമ്പ്യൂട്ടർ ഉറവിടങ്ങൾ ഉപയോഗിച്ച് ആൾമാറാട്ടം നടത്തി വഞ്ചിക്കുന്നതിനുള്ള ശിക്ഷയെക്കുറിച്ച് ഐ.ടി. ആക്ട് 2000-ലെ ഏത് വകുപ്പാണ് കൈകാര്യം ചെയ്യുന്നത് ?",
        options: ["വകുപ്പ് 66D", "വകുപ്പ് 66C", "വകുപ്പ് 66B", "വകുപ്പ് 66F"],
        correct: 0
    },
    {
        question: "ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട് 2000 - ന്റെ സെക്ഷൻ 43 -ൽ പരാമർശിച്ചിരിക്കുന്ന ഒരു പ്രവൃത്തി എങ്ങനെ ചെയ്താൽ കമ്പ്യൂട്ടറുമായി ബന്ധപ്പെട്ട കുറ്റകൃത്യമായി മാറും?",
        options: ["സത്യസന്ധതയില്ലാതെ അല്ലെങ്കിൽ വഞ്ചനയോടെ", "സത്യസന്ധമല്ലാത്തതോ കള്ളപ്രകരമായോ", "സത്യസന്ധതയില്ലാതെ അല്ലെങ്കിൽ അശ്രദ്ധമായി", "സത്യസന്ധതയില്ലാതെ അല്ലെങ്കിൽ മനഃപൂർവ്വം"],
        correct: 0
    },
    {
        question: "2000 - ലെ ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട് പ്രകാരം, ഐഡന്റിറ്റി മോഷണത്തിനുള്ള ശിക്ഷ?",
        options: ["2 വർഷം വരെ തടവും 1 ലക്ഷം വരെ പിഴയും", "2 വർഷം വരെ തടവും 2 ലക്ഷം വരെ പിഴയും", "3 വർഷം വരെ തടവും 1 ലക്ഷം വരെ പിഴയും", "3 വർഷം വരെ തടവും 2 ലക്ഷം വരെ പിഴയും"],
        correct: 2
    },
    {
        question: "ഇലക്ട്രോണിക് രൂപത്തിൽ ലൈംഗികത സ്പഷ്ടമാക്കുന്ന കാര്യങ്ങൾ പ്രസിദ്ധീകരിക്കുകയോ പ്രക്ഷേപണം ചെയ്യുകയോ ചെയ്തതിന് സെക്ഷൻ 67 A പ്രകാരമുള്ള രണ്ടാമത്തെ അല്ലെങ്കിൽ തുടർന്നുള്ള ശിക്ഷയ്ക്കുള്ള പരമാവധി ശിക്ഷ എന്താണ്?",
        options: ["അഞ്ച് വർഷം വരെ തടവും പത്ത് ലക്ഷം രൂപ വരെ പിഴയും", "ഏഴ് വർഷം വരെ തടവും പത്ത് ലക്ഷം രൂപ വരെ പിഴയും", "ഏഴ് വർഷം വരെ തടവും പതിനഞ്ച് ലക്ഷം രൂപ വരെ പിഴയും", "പത്ത് വർഷം വരെ തടവും പതിനഞ്ച് ലക്ഷം രൂപ വരെ പിഴയും"],
        correct: 1
    },
    {
        question: "ഐ.ടി ആക്ട് നിലവിൽ വന്ന വർഷം ഏത് ?",
        options: ["01.04.2001", "10.03.2000", "07.05.2000", "17.10.2000"],
        correct: 3
    },
    {
        question: "ഐ.ടി. ആക്ടിൽ സൈബർ ടെററിസം എന്നതിനെ പ്രതിപാദിക്കുന്ന വകുപ്പ് ഏത് ?",
        options: ["66 എ", "66 ബി", "66 ജി", "66 എഫ്"],
        correct: 3
    },
    {
        question: "വ്യാജ അക്കൗണ്ടുകൾ ഉപയോഗിച്ച് സമൂഹമാധ്യമങ്ങളിലൂടെ ഒരു വ്യക്തിയെ അപകീർത്തിപ്പെടുത്തുന്നത് വിവരസാങ്കേതികവിദ്യാ നിയമം 2000-ലെ ഏത് വകുപ്പ് പ്രകാരമാണ് ശിക്ഷാർഹമാകുന്നത് ?",
        options: ["വകുപ്പ് 66D", "വകുപ്പ് 66E", "വകുപ്പ് 66B", "വകുപ്പ് 66C"],
        correct: 0
    },
    {
        question: "ഐഡൻ്റിറ്റി മോഷണത്തിനുള്ള ശിക്ഷ ____________ ആണ്.",
        options: ["ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട് 2000- ന്റെ സെക്ഷൻ 66C", "ഇന്ത്യൻ ശിക്ഷാ നിയമത്തിലെ സെക്ഷൻ 378", "2000-ലെ ഇൻഫർമേഷൻ ടെക്നോളജി നിയമത്തിന്റെ സെക്ഷൻ 66 B", "മുകളിലുള്ളവയൊന്നുമല്ല"],
        correct: 0
    },
    {
        question: "ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട് 2000 പ്രകാരം മൂന്ന് വർഷം തടവ് ലഭിക്കാവുന്ന കുറ്റമാണ്.",
        options: ["കോഗ്നിസെബിൾ", "ജാമ്യം ലഭിക്കാവുന്നത്", "a) ഉം b)ഉം ശരിയാണ്", "മുകളിലുള്ളവയൊന്നുമല്ല"],
        correct: 2
    },
    {
        question: "പോലീസ് കണ്ടുകെട്ടിയ ഒരു മൊബൈൽ ഫോണിൽ ഫോണിന്റെ ഉടമ കുട്ടികളുടെ അശ്ലീല ചിത്രങ്ങൾ അടങ്ങുന്ന ഫയൽ സ്വമേധയോ സ്വീകരിച്ചതായും ഡൗൺലോഡ് ചെയ്തതായും കണ്ടെത്തി. എന്നാൽ ഫോൺ ഉടമ ആ ഫയലുകൾ മറ്റാർക്കും അയച്ചിരുന്നില്ല. ആ വ്യക്തി താഴെ പറയുന്നവയിൽ ഏത് വകുപ്പ് പ്രകാരമുള്ള കുറ്റത്തിന് അർഹനാണ്?",
        options: ["വകുപ്പ് 20 വിവരാവകാശ നിയമം 2005", "വകുപ്പ് 67A വിവരസാങ്കേതിക നിയമം 2000", "വകുപ്പ് 67B വിവര സാങ്കേതിക നിയമം 2000", "വകുപ്പ് 21 വിവരാവകാശ നിയമം 2005"],
        correct: 2
    },
    {
        question: "കമ്പ്യൂട്ടറിന്റെ ഉടമയുടെ അനുമതിയില്ലാതെ ആരെങ്കിലും അനധികൃതമായി സത്യസന്ധതയില്ലാതെയോ വഞ്ചനാപരമായോ ആ കമ്പ്യൂട്ടറിൽ പ്രവേശനം ചെയ്താൽ ആ വ്യക്തിക്കെതിരെ വിവരസാങ്കേതിക നിയമം 2000 പ്രകാരം ഏത് കുറ്റം ചുമത്താവുന്നതാണ് ?",
        options: ["ഹാക്കിംഗ്", "വകുപ്പ് 66 കമ്പ്യൂട്ടർ സംബന്ധമായ കുറ്റകൃത്യങ്ങൾ", "വകുപ്പ് 66C ഐഡൻ്റിറ്റി മോഷണം", "വകുപ്പ് 43 പ്രകാരം കുറ്റകൃത്യം അല്ല പിഴ മാത്രം കൊടുത്താൽ മതി"],
        correct: 1
    },
    {
        question: "IT ആക്ടിലെ സെക്ഷൻ 66C എന്തിനെക്കുറിച്ചാണ് പറയുന്നത് ?",
        options: ["സൈബർ ഭീകരതയ്ക്കുള്ള ശിക്ഷ", "കമ്പ്യൂട്ടർ സിസ്റ്റത്തിലേക്കുള്ള അനധികൃത പ്രവേശനത്തിനുള്ള ശിക്ഷ", "ഐഡൻ്റിറ്റി മോഷണത്തിനുള്ള ശിക്ഷ", "ഓൺലൈനിൽ അശ്ലീലമായ കാര്യങ്ങൾ പ്രസിദ്ധീകരിക്കുകയോ പ്രക്ഷേപണം ചെയ്യുകയോ ചെയ്യുന്നതിനുള്ള ശിക്ഷ"],
        correct: 2
    },
    {
        question: "കുട്ടികളുടെ അശ്ലീലചിത്രങ്ങൾ സാമൂഹിക മാധ്യമം വഴി വിതരണം ചെയ്യുന്നത് വിവരസാങ്കേതിക വിദ്യാനിയമത്തിലെ ഏത് വകുപ്പ് പ്രകാരമാണ് കുറ്റകൃത്യം ആകുന്നത്.",
        options: ["67 (B) വകുപ്പ് പ്രകാരം", "65-ാം വകുപ്പ് പ്രകാരം", "66-ാം വകുപ്പ് പ്രകാരം", "68-ാം വകുപ്പ് പ്രകാരം"],
        correct: 0
    },
    {
        question: "സാങ്കേതിക വിദ്യാനിയമപ്രകാരം ഒരു വ്യക്തി മറ്റൊരാളുടെ ഇലക്ട്രോണിക് സിഗ്നേച്ചർ അവരെ വഞ്ചിക്കണമെന്ന ഉദ്ദേശത്തോടെ ഉപയോഗിച്ചാൽ ലഭിക്കുന്ന ശിക്ഷ :",
        options: ["3 വർഷം തടവും ഒരു ലക്ഷം രൂപ പിഴയും", "2 വർഷം തടവും ഒരു ലക്ഷം രൂപ പിഴയും", "1 വർഷം തടവും രണ്ടു ലക്ഷം രൂപ പിഴയും", "3 വർഷം തടവും രണ്ടു ലക്ഷം രൂപ പിഴയും"],
        correct: 0
    },
    {
        question: "മറ്റു വ്യക്തിയുടെ എ.ടി.എം. കാർഡ് ഉപയോഗിച്ച് മോഷണം നടത്തുന്നത് ശിക്ഷാർഹമാക്കുന്നത് ഏത് നിയമം ആണ് ?",
        options: ["വകുപ്പ് 70 ഇൻഫർമേഷൻ ടെക്നോളജി നിയമം", "വകുപ്പ് 70 ഇന്ത്യൻ ശിക്ഷാ നിയമം", "വകുപ്പ് 66 ഇൻഫർമേഷൻ ടെക്നോളജി നിയമം", "വകുപ്പ് 66 ഇന്ത്യൻ ശിക്ഷാനിയമം"],
        correct: 2
    },
    {
        question: "താഴെ പറയുന്നതിൽ വിവര സാങ്കേതിക നിയമ പ്രകാരം ജീവപര്യന്തം വരെ തടവുശിക്ഷ ലഭിക്കാവുന്ന കുറ്റം.",
        options: ["വ്യക്തി വിവര മോഷണം", "സ്വകാര്യത നശിപ്പിക്കൽ", "സ്ത്രീകളെ അപമാനിക്കൽ", "സൈബർ ടെററിസം"],
        correct: 3
    },
    {
        question: "ഐ.ടി. ആക്ട് 2000 സെക്ഷൻ 43 A പ്രകാരം, താഴെ പറയുന്നവയിൽ ആരാണ് നഷ്ടപരിഹാരം കൊടുക്കാൻ ബാധ്യസ്ഥൻ ? i) കമ്പനി ii) പാർട്ട്ണർഷിപ്പ് സ്ഥാപനം iii) വ്യക്തി",
        options: ["(i & ii) മാത്രം", "(i & iii) മാത്രം", "(ii & iii) മാത്രം", "(i, ii & iii)"],
        correct: 3
    },
    {
        question: "ഒരു വ്യക്തി ഐ.ടി ആക്ട് 2000 സെക്ഷൻ 43 ൽ പറഞ്ഞിരിക്കുന്ന കുറ്റങ്ങൾ സത്യസന്ധതയില്ലാതെയോ വഞ്ചനാപരമായോ ചെയ്യുകയാണെങ്കിൽ ലഭിക്കാവുന്ന പരമാവധി ശിക്ഷ എത്രയാണ് ?",
        options: ["ഒരു വർഷം തടവും ഒരു ലക്ഷം പിഴയും", "രണ്ടു വർഷം തടവും മൂന്നു ലക്ഷം പിഴയും", "മൂന്നു വർഷം തടവും അഞ്ചു ലക്ഷം പിഴയും", "മുകളിൽ പറഞ്ഞതൊന്നുമല്ല (PSCഉത്തരസൂചിക പ്രകാരം)"],
        correct: 3
    },
    {
        question: "ഐഡൻ്റിറ്റി മോഷണത്തിനുള്ള ശിക്ഷ ____________ പ്രകാരം നൽകിയിരിക്കുന്നു.",
        options: ["സെക്ഷൻ 356 ഇന്ത്യൻ ശിക്ഷാ നിയമം, 1860", "സെക്ഷൻ 353 ഇന്ത്യൻ ശിക്ഷാ നിയമം, 1860", "സെക്ഷൻ 66C ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട്, 2000", "സെക്ഷൻ 65 ഇൻഫർമേഷൻ ടെക്നോളജി ആക്ട്, 2008"],
        correct: 2
    },
    {
        question: "സൈബർ ഭീകരവാദത്തിന് വിവരസാങ്കേതിക നിയമം പ്രതിപാദിക്കുന്ന പരമാവധി ശിക്ഷ.",
        options: ["വധശിക്ഷ", "ജീവപര്യന്തം തടവ്", "14 വർഷം തടവ്", "12 വർഷം തടവ്"],
        correct: 1
    },
    {
        question: "ഇലക്ട്രോണിക് മാധ്യമങ്ങളിലൂടെ അശ്ലീല ചിത്രങ്ങൾ പ്രചരിപ്പിക്കുകയോ അശ്ലീല വസ്തുക്കൾ പ്രദർശിപ്പിക്കുകയോ ചെയ്യുന്നത് ഏത് പേരിലാണ് അറിയപ്പെടുന്നത് ?",
        options: ["സൈബർ ആൾമാറാട്ടം", "സൈബർ ഭീകരവാദം", "സൈബർ പോർണോഗ്രാഫി", "സൈബർ വ്യക്തിവിവര മോഷണം"],
        correct: 2
    },
    {
        question: "ഐ.ടി. ആക്റ്റ് പ്രകാരം ഒരാളുടെ യൂസർനേം, പാസ്‌വേഡ് മുതലായവ ചോർത്തുകയും ഉപയോഗിക്കുകയും ചെയ്യുന്നതിന് ലഭിക്കാവുന്ന പരമാവധി ശിക്ഷയെന്ത്?",
        options: ["അഞ്ച് വർഷത്തെ തടവ്", "മൂന്ന് വർഷത്തെ തടവ്", "ഒരു വർഷത്തെ തടവ്", "ഏഴ് വർഷത്തെ തടവ്"],
        correct: 1
    },
    {
        question: "ഐ.ടി.ആക്ട് 2000 പ്രകാരം, സൈബർ തീവ്രവാദത്തിനുള്ള പരമാവധി തടവു ശിക്ഷ എത്രയാണ് ?",
        options: ["ജീവപര്യന്തം തടവ്", "12 വർഷം തടവ്", "10 വർഷം തടവ്", "7 വർഷം തടവ്"],
        correct: 0
    },
    {
        question: "ഇലക്ട്രോണിക് രൂപത്തിൽ കുട്ടികളെ സംബന്ധിക്കുന്ന അശ്ലീലം പ്രദർശിപ്പിക്കുകയും പ്രചരിപ്പിക്കുകയും ചെയ്യുന്ന വ്യക്തിക്ക് തുടർച്ചയായി കുറ്റക്കാരനാണെന്ന് കാണുകയാണെങ്കിൽ ഐ.ടി. ആക്റ്റ് പ്രകാരം ലഭിക്കാവുന്ന പരമാവധി ശിക്ഷയെന്ത്?",
        options: ["3 വർഷ തടവും 10 ലക്ഷം പിഴയും", "5 വർഷ തടവും 5 ലക്ഷം പിഴയും", "7 വർഷ തടവും 5 ലക്ഷം പിഴയും", "7 വർഷ തടവും 10 ലക്ഷം പിഴയും"],
        correct: 3
    }
];
